# Ускоренная обработка данных:
# lambda, filter, map, zip, enumerate, List Comprehension


#==========================  Анонимные, lambda функции  ===========================================

#==================================================================================================
# def f(x):
#     return x**2

# g = f # сохраняем в g всю функцию целиком (в итоге есть переменная которая хранит в себе функцию)

# print(type(f))
# print(type(g))
#==================================================================================================
# def calc1(x):
#     return x+10

# # print(calc1(10))

# def calc2(x):
#     return x*10
# # print(calc2(10))

# def math(op, x): # функция приняла операцию
#     print(op(x))

# math(calc2, 10)
# math(calc1, 10)
#==================================================================================================

# # def sum(x,y):
# #     return x+y

# # sum = lambda x, y: x + y 


# def mul(x,y):
#     return x*y

# def calc(op, a, b):
#     print(op(a, b))
#     # return op(a, b)

# calc(lambda x, y: x + y, 4, 5)
#==================================================================================================

#========================== List Comprehension  ===================================================
# позволяет упростить логику, создание списков и обрабатываеь данные

# [exp for item in iterable]
# [exp for item in iterable (if conditional)]
# [exp <if conditional> for item in iterable (if conditional)]

# получим четные элементы из диапозона
# list = []
# for i in range(1,101):
#     # if(i%2==0):
#         list.append(i)
# print(list)
# === это тоже самое что сверху ===
# list = [(i, i) for i in range(1, 21) if i % 2 == 0] # (i,i) значения кортежа
# print(list)

# === если от функции ===
# def f(x):
#     return x**3

# list = [(i, f(i)) for i in range(1, 21) if i % 2 == 0]
# print(list)

#==================================================================================================

# К чему это всё?
# В файле хранятся числа, нужно выбрать четные и составить список пар (число; квадрат числа).
# Пример:
# 1 2 3 5 8 15 23 38
# Получить:
# [(2, 4), (8, 64), (38, 1444)]

#==================================================================================================
# f = open('f.txt', 'r') # открываю список
# data = f.read() + ' '
# f.close()

# numbers = [] # создаю список
# while data != '': # пока моя строка не пустая
#     space_pos = data.index(' ') # найти от первого символа
#     numbers.append(int(data[:space_pos])) # до позиции пробела
#     data = data[space_pos+1:]

# out = [] # новый список
# for e in numbers: # пробежаться по тому списку
#     if not e % 2: #  проверить на четность
#             out.append((e,e **2))
# print(out)
#==================================================================================================

def select(f, col):
    return[f(x) for x in col]

def where(f, col):
    return[x for x in col if(x)]

data = '1 2 3 5 8 15 23 38'.split() # набор строк

res = select(int, data)
res = where(lambda x: not x % 2, res) # вывд только нечетных чисел
res = select(lambda x:(x, x**2), res)
print(res)
#==================================================================================================

#==============================        Функция map       ==========================================

# Функция map() применяет указанную функцию к каждому элементу итерируемого объекта 
# и возвращает итератор с новыми объектами.

# f(x) ⇒ x + 10
# map(f, [ 1, 2, 3, 4, 5])
#          ↓  ↓  ↓  ↓  ↓
#        [11,12,13,14,15]
# Нельзя пройтись дважды

#==================================================================================================
li = [x for x in ]
